socorromipunto-eng/guardian-f401/firmware/Platform/STM32F401/Src/stm32f401_acquisition.c
/* Include the public STM32F401 acquisition adapter declarations. */
#include "stm32f401_acquisition.h"

/* Include the shared STM32F401CDU6 compile-time target contract. */
#include "guardian_stm32f401_target.h"

/* Include official ST CMSIS peripheral declarations supplied by the Keil device pack. */
#include "stm32f4xx.h"

/* Include uintptr_t for portable pointer-to-register address conversion. */
#include <stdint.h>

/* Define GPIO register field helpers. */
#define GUARDIAN_GPIO_MODE_MASK ((uint32_t)0x3U)
#define GUARDIAN_GPIO_MODE_ANALOG ((uint32_t)0x3U)
#define GUARDIAN_GPIO_MODE_AF ((uint32_t)0x2U)
#define GUARDIAN_GPIO_AF_MASK ((uint32_t)0xFU)

/* Define RCC enable bits consumed by the acquisition path. */
#define GUARDIAN_RCC_AHB1_GPIOAEN ((uint32_t)1UL << 0U)
#define GUARDIAN_RCC_AHB1_DMA2EN ((uint32_t)1UL << 22U)
#define GUARDIAN_RCC_APB1_TIM2EN ((uint32_t)1UL << 0U)
#define GUARDIAN_RCC_APB1_TIM3EN ((uint32_t)1UL << 1U)
#define GUARDIAN_RCC_APB2_ADC1EN ((uint32_t)1UL << 8U)

/* Define RCC APB1 prescaler field geometry. */
#define GUARDIAN_RCC_PPRE1_SHIFT ((uint32_t)10U)
#define GUARDIAN_RCC_PPRE1_MASK ((uint32_t)0x7U << GUARDIAN_RCC_PPRE1_SHIFT)

/* Define RCC APB2 prescaler field geometry. */
#define GUARDIAN_RCC_PPRE2_SHIFT ((uint32_t)13U)
#define GUARDIAN_RCC_PPRE2_MASK ((uint32_t)0x7U << GUARDIAN_RCC_PPRE2_SHIFT)

/* Define TIM control bits used by the deterministic trigger and RPM capture path. */
#define GUARDIAN_TIM_CR1_CEN ((uint32_t)1UL << 0U)
#define GUARDIAN_TIM_CR1_ARPE ((uint32_t)1UL << 7U)
#define GUARDIAN_TIM_CR2_MMS_UPDATE ((uint32_t)0x2U << 4U)
#define GUARDIAN_TIM_DIER_UIE ((uint32_t)1UL << 0U)
#define GUARDIAN_TIM_DIER_CC1IE ((uint32_t)1UL << 1U)
#define GUARDIAN_TIM_SR_UIF ((uint32_t)1UL << 0U)
#define GUARDIAN_TIM_SR_CC1IF ((uint32_t)1UL << 1U)
#define GUARDIAN_TIM_SR_CC1OF ((uint32_t)1UL << 9U)
#define GUARDIAN_TIM_EGR_UG ((uint32_t)1UL << 0U)
#define GUARDIAN_TIM_CCMR1_CC1S_TI1 ((uint32_t)0x1U << 0U)
#define GUARDIAN_TIM_CCMR1_IC1F_8_SAMPLES ((uint32_t)0x3U << 4U)
#define GUARDIAN_TIM_CCER_CC1E ((uint32_t)1UL << 0U)

/* Define ADC control bits and external-trigger selection. */
#define GUARDIAN_ADC_CR1_SCAN ((uint32_t)1UL << 8U)
#define GUARDIAN_ADC_CR1_OVRIE ((uint32_t)1UL << 26U)
#define GUARDIAN_ADC_CR2_ADON ((uint32_t)1UL << 0U)
#define GUARDIAN_ADC_CR2_DMA ((uint32_t)1UL << 8U)
#define GUARDIAN_ADC_CR2_DDS ((uint32_t)1UL << 9U)
#define GUARDIAN_ADC_CR2_EXTSEL_TIM2_TRGO ((uint32_t)0x6U << 24U)
#define GUARDIAN_ADC_CR2_EXTEN_RISING ((uint32_t)0x1U << 28U)
#define GUARDIAN_ADC_SR_OVR ((uint32_t)1UL << 5U)

/* Define ADC common-control fields used by clocking, VREFINT and temperature. */
#define GUARDIAN_ADC_CCR_ADCPRE_MASK ((uint32_t)0x3U << 16U)
#define GUARDIAN_ADC_CCR_ADCPRE_DIV2 ((uint32_t)0x0U << 16U)
#define GUARDIAN_ADC_CCR_ADCPRE_DIV4 ((uint32_t)0x1U << 16U)
#define GUARDIAN_ADC_CCR_ADCPRE_DIV6 ((uint32_t)0x2U << 16U)
#define GUARDIAN_ADC_CCR_ADCPRE_DIV8 ((uint32_t)0x3U << 16U)
#define GUARDIAN_ADC_CCR_VBATE ((uint32_t)1UL << 22U)
#define GUARDIAN_ADC_CCR_TSVREFE ((uint32_t)1UL << 23U)

/* Keep ADC clock at or below 18 MHz so the reference remains conservative across VDDA range. */
#define GUARDIAN_ADC_CONSERVATIVE_MAX_CLOCK_HZ ((uint32_t)18000000UL)

/* Count complete 12-bit ADC cycles in one five-channel M6 regular scan sequence. */
#define GUARDIAN_ADC_SEQUENCE_CYCLES ((uint32_t)1188UL)

/* Define ADC sample-time encodings from RM0368. */
#define GUARDIAN_ADC_SAMPLE_56_CYCLES ((uint32_t)0x3U)
#define GUARDIAN_ADC_SAMPLE_480_CYCLES ((uint32_t)0x7U)

/* Define the regular scan sequence length field for five conversions. */
#define GUARDIAN_ADC_SQR1_LENGTH_5 ((uint32_t)4U << 20U)

/* Define the fixed ADC1 channel numbers used by the reference scan. */
#define GUARDIAN_ADC_CHANNEL_VIBRATION ((uint32_t)0U)
#define GUARDIAN_ADC_CHANNEL_CURRENT ((uint32_t)1U)
#define GUARDIAN_ADC_CHANNEL_SUPPLY ((uint32_t)4U)
#define GUARDIAN_ADC_CHANNEL_TEMPERATURE ((uint32_t)16U)
#define GUARDIAN_ADC_CHANNEL_VREFINT ((uint32_t)17U)

/* Define DMA2 Stream0 control bits for ADC1 Channel 0 double-buffer acquisition. */
#define GUARDIAN_DMA_CR_EN ((uint32_t)1UL << 0U)
#define GUARDIAN_DMA_CR_DMEIE ((uint32_t)1UL << 1U)
#define GUARDIAN_DMA_CR_TEIE ((uint32_t)1UL << 2U)
#define GUARDIAN_DMA_CR_TCIE ((uint32_t)1UL << 4U)
#define GUARDIAN_DMA_CR_CIRC ((uint32_t)1UL << 8U)
#define GUARDIAN_DMA_CR_MINC ((uint32_t)1UL << 10U)
#define GUARDIAN_DMA_CR_PSIZE_16 ((uint32_t)0x1U << 11U)
#define GUARDIAN_DMA_CR_MSIZE_16 ((uint32_t)0x1U << 13U)
#define GUARDIAN_DMA_CR_PRIORITY_HIGH ((uint32_t)0x2U << 16U)
#define GUARDIAN_DMA_CR_DBM ((uint32_t)1UL << 18U)
#define GUARDIAN_DMA_CR_CT ((uint32_t)1UL << 19U)

/* Define DMA2 Stream0 low-status and flag-clear bits. */
#define GUARDIAN_DMA_FEIF0 ((uint32_t)1UL << 0U)
#define GUARDIAN_DMA_DMEIF0 ((uint32_t)1UL << 2U)
#define GUARDIAN_DMA_TEIF0 ((uint32_t)1UL << 3U)
#define GUARDIAN_DMA_HTIF0 ((uint32_t)1UL << 4U)
#define GUARDIAN_DMA_TCIF0 ((uint32_t)1UL << 5U)
#define GUARDIAN_DMA_STREAM0_ALL_FLAGS \
    (GUARDIAN_DMA_FEIF0 | \
     GUARDIAN_DMA_DMEIF0 | \
     GUARDIAN_DMA_TEIF0 | \
     GUARDIAN_DMA_HTIF0 | \
     GUARDIAN_DMA_TCIF0)

/* Define ready-mask bits for the two DMA target buffers. */
#define GUARDIAN_DMA_BUFFER_0_READY ((uint8_t)0x01U)
#define GUARDIAN_DMA_BUFFER_1_READY ((uint8_t)0x02U)

/* Allocate the first DMA target buffer for 64 complete five-channel scan frames. */
static uint16_t guardian_dma_buffer_0[GUARDIAN_ACQUISITION_SAMPLES_PER_BLOCK];

/* Allocate the second DMA target buffer for hardware double-buffer mode. */
static uint16_t guardian_dma_buffer_1[GUARDIAN_ACQUISITION_SAMPLES_PER_BLOCK];

/* Allocate one foreground snapshot buffer so DMA never mutates data during conversion math. */
static uint16_t guardian_process_buffer[GUARDIAN_ACQUISITION_SAMPLES_PER_BLOCK];

/* Store the portable raw-to-engineering-unit processor. */
static guardian_acquisition_t guardian_acquisition;

/* Store the active explicit hardware configuration. */
static guardian_stm32f401_acquisition_config_t guardian_config;

