socorromipunto-eng/guardian-f401/firmware/Platform/STM32F401/Src/stm32f401_acquisition.c
/* Store the active TIM3 counter frequency after prescaler rounding. */
static uint32_t guardian_rpm_timer_hz = 0U;

/* Store the runtime-selected ADC common prescaler register encoding. */
static uint32_t guardian_adc_prescaler_bits =
    GUARDIAN_ADC_CCR_ADCPRE_DIV2;

/* Store the resulting ADC kernel clock in hertz. */
static uint32_t guardian_adc_clock_hz = 0U;

/* Store the most recent software-extended TIM3 capture timestamp. */
static volatile uint32_t guardian_last_rpm_timestamp = 0U;

/* Store the software extension count for TIM3 16-bit counter overflows. */
static volatile uint32_t guardian_rpm_overflow_count = 0U;

/* Store whether one previous RPM edge exists for period calculation. */
static volatile uint8_t guardian_has_rpm_capture = 0U;

/* Store the most recently calculated shaft speed. */
static volatile uint16_t guardian_rpm = 0U;

/* Store elapsed milliseconds since the most recent valid RPM period. */
static volatile uint32_t guardian_rpm_age_ms = UINT32_MAX;

/* Store whether the most recent RPM value is fresh. */
static volatile uint8_t guardian_rpm_valid = 0U;

/* Store completed DMA target buffers awaiting foreground processing. */
static volatile uint8_t guardian_ready_mask = 0U;

/* Store quality flags that must accompany the next successfully processed block. */
static volatile uint16_t guardian_pending_quality_flags = 0U;

/* Store whether ADC/DMA state must be rebuilt in foreground code. */
static volatile uint8_t guardian_recovery_required = 0U;

/* Store whether hardware acquisition initialization completed successfully. */
static volatile uint8_t guardian_initialized = 0U;

/* Store cumulative hardware diagnostics. */
static volatile guardian_stm32f401_acquisition_stats_t guardian_hw_stats = {0};

/* Saturating-increment one volatile unsigned 32-bit diagnostic counter. */
static void guardian_stm32f401_increment_u32(
    volatile uint32_t *value)
{
    /* Ignore a missing diagnostic pointer defensively. */
    if (value == NULL)
    {
        /* Return without touching memory. */
        return;
    }

    /* Avoid counter wrap because diagnostics should remain monotonic. */
    if (*value != UINT32_MAX)
    {
        /* Increment only while representable. */
        *value += 1U;
    }
}

/* Read one factory calibration half-word from the documented system-memory address. */
static uint16_t guardian_stm32f401_factory_u16(
    uintptr_t address)
{
    /* Convert the fixed system-memory address into a read-only volatile half-word pointer. */
    const volatile uint16_t *value =
        (const volatile uint16_t *)address;

    /* Return the factory-programmed calibration value. */
    return *value;
}

/* Return the current APB1 peripheral clock derived from SystemCoreClock and RCC PPRE1. */
static uint32_t guardian_stm32f401_pclk1_hz(void)
{
    /* Extract the three-bit APB1 prescaler field. */
    uint32_t ppre1 =
        (RCC->CFGR & GUARDIAN_RCC_PPRE1_MASK) >>
        GUARDIAN_RCC_PPRE1_SHIFT;

    /* Return HCLK directly when APB1 is not divided. */
    if (ppre1 < 4U)
    {
        /* CMSIS SystemCoreClock represents HCLK on STM32F4. */
        return SystemCoreClock;
    }

    /* Decode the APB divisor as 2^(PPRE1 - 3). */
    return SystemCoreClock >> (ppre1 - 3U);
}

/* Return the current APB2 peripheral clock derived from SystemCoreClock and RCC PPRE2. */
static uint32_t guardian_stm32f401_pclk2_hz(void)
{
    /* Extract the three-bit APB2 prescaler field. */
    uint32_t ppre2 =
        (RCC->CFGR & GUARDIAN_RCC_PPRE2_MASK) >>
        GUARDIAN_RCC_PPRE2_SHIFT;

    /* Return HCLK directly when APB2 is not divided. */
    if (ppre2 < 4U)
    {
        /* CMSIS SystemCoreClock represents HCLK on STM32F4. */
        return SystemCoreClock;
    }

    /* Decode the APB divisor as 2^(PPRE2 - 3). */
    return SystemCoreClock >> (ppre2 - 3U);
}

/* Select the fastest ADC prescaler that never exceeds the conservative 18 MHz ceiling. */
static int guardian_stm32f401_select_adc_clock(void)
{
    /* Read the active APB2 peripheral clock that feeds the ADC common prescaler. */
    uint32_t pclk2_hz =
        guardian_stm32f401_pclk2_hz();

    /* Define the four hardware ADC prescaler divisors in fastest-first order. */
    static const uint8_t divisors[4] =
    {
        2U,
        4U,
        6U,
        8U
    };

    /* Define the register encoding corresponding to each hardware divisor. */
    static const uint32_t encodings[4] =
    {
        GUARDIAN_ADC_CCR_ADCPRE_DIV2,
        GUARDIAN_ADC_CCR_ADCPRE_DIV4,
        GUARDIAN_ADC_CCR_ADCPRE_DIV6,
        GUARDIAN_ADC_CCR_ADCPRE_DIV8
    };

    /* Track the current prescaler candidate. */
    size_t index = 0U;

    /* Reject an unavailable APB2 clock. */
    if (pclk2_hz == 0U)
    {
        /* Report invalid clock configuration. */
        return 0;
    }

    /* Select the fastest legal ADC clock. */
    for (index = 0U; index < 4U; ++index)
    {
        /* Calculate the ADC kernel clock for this prescaler. */
        uint32_t candidate_hz =
            pclk2_hz /
            (uint32_t)divisors[index];

        /* Accept the first candidate that satisfies the conservative ceiling. */
        if ((candidate_hz != 0U) &&
            (candidate_hz <=
             GUARDIAN_ADC_CONSERVATIVE_MAX_CLOCK_HZ))
        {
            /* Preserve the selected ADC common-control encoding. */
            guardian_adc_prescaler_bits =
                encodings[index];

            /* Preserve the resulting ADC kernel clock for throughput validation. */
            guardian_adc_clock_hz =
                candidate_hz;

            /* Report successful ADC clock selection. */
            return 1;
        }
    }

    /* Report that no hardware prescaler can satisfy the conservative ADC clock ceiling. */
    return 0;
}

/* Return the timer kernel clock associated with APB1. */
static uint32_t guardian_stm32f401_apb1_timer_hz(void)
{
    /* Read the active APB1 peripheral clock. */
    uint32_t pclk1_hz =
        guardian_stm32f401_pclk1_hz();

    /* Extract the three-bit APB1 prescaler field. */
    uint32_t ppre1 =
        (RCC->CFGR & GUARDIAN_RCC_PPRE1_MASK) >>
        GUARDIAN_RCC_PPRE1_SHIFT;

    /* Timers run at PCLK1 when APB1 is not divided. */
    if (ppre1 < 4U)
    {
        /* Return the undoubled timer clock. */
        return pclk1_hz;
    }

    /* STM32F4 APB timers run at twice PCLK when the APB prescaler is greater than one. */
    return pclk1_hz * 2U;
}

/* Execute a conservative short startup delay using CMSIS NOP instructions. */
static void guardian_stm32f401_startup_delay(void)
{
    /* Calculate a deliberately conservative loop count from the current HCLK. */
    volatile uint32_t loops =
        (SystemCoreClock / 1000000UL) * 50UL;

    /* Consume the bounded delay before TIM2 begins triggering internal ADC channels. */
    while (loops != 0U)
    {
        /* Prevent the compiler from removing the timing loop completely. */
        __NOP();

        /* Advance toward delay completion. */
        loops -= 1U;
    }
}

/* Configure one GPIOA pin for analog mode with no internal pulls. */
static void guardian_stm32f401_gpio_analog(
    uint32_t pin)
{
    /* Clear the two-bit mode field before selecting analog mode. */
    GPIOA->MODER &=
        ~(GUARDIAN_GPIO_MODE_MASK << (pin * 2U));

    /* Select analog mode. */
    GPIOA->MODER |=
        (GUARDIAN_GPIO_MODE_ANALOG << (pin * 2U));

    /* Disable internal pull-up and pull-down resistors. */
    GPIOA->PUPDR &=
        ~(GUARDIAN_GPIO_MODE_MASK << (pin * 2U));
}

/* Configure PA6 for TIM3 channel-1 input capture on AF2. */
static void guardian_stm32f401_gpio_rpm(void)
{
    /* Clear the PA6 mode field. */
    GPIOA->MODER &=
        ~(GUARDIAN_GPIO_MODE_MASK << (GUARDIAN_STM32F401_RPM_PIN * 2U));

    /* Select alternate-function mode for PA6. */
    GPIOA->MODER |=
        (GUARDIAN_GPIO_MODE_AF << (GUARDIAN_STM32F401_RPM_PIN * 2U));

    /* Disable internal pulls so the external sensor/front-end defines the logic level. */
    GPIOA->PUPDR &=
        ~(GUARDIAN_GPIO_MODE_MASK << (GUARDIAN_STM32F401_RPM_PIN * 2U));

    /* Clear the PA6 AFRL field. */
    GPIOA->AFR[0] &=
        ~(GUARDIAN_GPIO_AF_MASK << (GUARDIAN_STM32F401_RPM_PIN * 4U));

