socorromipunto-eng/guardian-f401/firmware/Platform/STM32F401/Src/stm32f401_acquisition.c
    /* Select AF2 TIM3_CH1 for PA6. */
    GPIOA->AFR[0] |=
        (GUARDIAN_STM32F401_RPM_AF << (GUARDIAN_STM32F401_RPM_PIN * 4U));
}

/* Configure TIM2 update events as the deterministic ADC scan trigger. */
static int guardian_stm32f401_configure_sample_timer(void)
{
    /* Read the active TIM2 kernel clock. */
    uint32_t timer_hz =
        guardian_stm32f401_apb1_timer_hz();

    /* Store the rounded number of timer clocks in one sample period. */
    uint64_t period_ticks = 0U;

    /* Reject an unavailable timer clock. */
    if (timer_hz == 0U)
    {
        /* Report invalid clock configuration. */
        return 0;
    }

    /* Calculate the nearest whole-number TIM2 period without a prescaler. */
    period_ticks =
        (
            (uint64_t)timer_hz +
            ((uint64_t)guardian_config.sample_rate_hz / 2U)
        ) /
        (uint64_t)guardian_config.sample_rate_hz;

    /* Reject impossible or unrepresentable sample periods. */
    if ((period_ticks == 0U) ||
        (period_ticks > ((uint64_t)UINT32_MAX + 1U)))
    {
        /* Report unsupported sample timing. */
        return 0;
    }

    /* Stop TIM2 before changing its timebase. */
    TIM2->CR1 = 0U;

    /* Use the full APB1 timer clock for maximum trigger precision. */
    TIM2->PSC = 0U;

    /* Program the rounded 32-bit auto-reload period. */
    TIM2->ARR =
        (uint32_t)(period_ticks - 1U);

    /* Reset the counter before publishing the new period. */
    TIM2->CNT = 0U;

    /* Select update event as TIM2 TRGO for ADC1. */
    TIM2->CR2 =
        GUARDIAN_TIM_CR2_MMS_UPDATE;

    /* Generate one update so the new prescaler and auto-reload values become active. */
    TIM2->EGR =
        GUARDIAN_TIM_EGR_UG;

    /* Clear the software-generated update flag before acquisition starts. */
    TIM2->SR = 0U;

    /* Enable auto-reload preload while leaving the timer stopped. */
    TIM2->CR1 =
        GUARDIAN_TIM_CR1_ARPE;

    /* Report successful sample timer configuration. */
    return 1;
}

/* Configure TIM3 channel-1 rising-edge input capture for RPM measurement. */
static int guardian_stm32f401_configure_rpm_timer(void)
{
    /* Read the active TIM3 kernel clock. */
    uint32_t timer_hz =
        guardian_stm32f401_apb1_timer_hz();

    /* Store the nearest prescaler divisor for the reference RPM counter rate. */
    uint32_t divisor = 0U;

    /* Reject an unavailable timer clock. */
    if (timer_hz == 0U)
    {
        /* Report invalid clock configuration. */
        return 0;
    }

    /* Round the timer prescaler divisor to the nearest whole value. */
    divisor =
        (
            timer_hz +
            (GUARDIAN_STM32F401_RPM_TIMER_HZ / 2U)
        ) /
        GUARDIAN_STM32F401_RPM_TIMER_HZ;

    /* Require a divisor representable by the 16-bit TIM3 prescaler. */
    if ((divisor == 0U) || (divisor > 65536U))
    {
        /* Report unsupported RPM timer timing. */
        return 0;
    }

    /* Store the actual counter rate after integer prescaler rounding. */
    guardian_rpm_timer_hz =
        timer_hz / divisor;

    /* Stop TIM3 before changing input capture configuration. */
    TIM3->CR1 = 0U;

    /* Program the 16-bit prescaler. */
    TIM3->PSC =
        divisor - 1U;

    /* Use the full 16-bit counter range so unsigned capture subtraction handles one wrap. */
    TIM3->ARR = 0xFFFFU;

    /* Reset the free-running capture counter. */
    TIM3->CNT = 0U;

    /* Route TI1 into capture channel 1 and apply a modest digital input filter. */
    TIM3->CCMR1 =
        GUARDIAN_TIM_CCMR1_CC1S_TI1 |
        GUARDIAN_TIM_CCMR1_IC1F_8_SAMPLES;

    /* Enable rising-edge channel-1 capture with default non-inverted polarity. */
    TIM3->CCER =
        GUARDIAN_TIM_CCER_CC1E;

    /* Enable update and channel-1 capture interrupts for software-extended timestamps. */
    TIM3->DIER =
        GUARDIAN_TIM_DIER_UIE |
        GUARDIAN_TIM_DIER_CC1IE;

    /* Generate an update so the prescaler becomes active immediately. */
    TIM3->EGR =
        GUARDIAN_TIM_EGR_UG;

    /* Clear the generated update and stale capture flags. */
    TIM3->SR = 0U;

    /* Configure the requested TIM3 interrupt priority. */
    NVIC_SetPriority(
        TIM3_IRQn,
        guardian_config.rpm_irq_priority);

    /* Enable TIM3 interrupt delivery. */
    NVIC_EnableIRQ(
        TIM3_IRQn);

    /* Start the free-running RPM capture counter. */
    TIM3->CR1 =
        GUARDIAN_TIM_CR1_CEN;

    /* Report successful RPM timer configuration. */
    return 1;
}

/* Configure ADC1 scan order, sample times, VREFINT and temperature sensor. */
static void guardian_stm32f401_configure_adc(void)
{
    /* Stop ADC1 before replacing conversion configuration. */
    ADC1->CR2 = 0U;

    /* Enable scan mode and ADC overrun interrupts. */
    ADC1->CR1 =
        GUARDIAN_ADC_CR1_SCAN |
        GUARDIAN_ADC_CR1_OVRIE;

    /* Configure 56-cycle sample time for ADC1 channel 0. */
    ADC1->SMPR2 &=
        ~((uint32_t)0x7U << (GUARDIAN_ADC_CHANNEL_VIBRATION * 3U));

    /* Apply the external-channel sample time for vibration. */
    ADC1->SMPR2 |=
        GUARDIAN_ADC_SAMPLE_56_CYCLES <<
        (GUARDIAN_ADC_CHANNEL_VIBRATION * 3U);

    /* Configure 56-cycle sample time for ADC1 channel 1. */
    ADC1->SMPR2 &=
        ~((uint32_t)0x7U << (GUARDIAN_ADC_CHANNEL_CURRENT * 3U));

    /* Apply the external-channel sample time for current. */
    ADC1->SMPR2 |=
        GUARDIAN_ADC_SAMPLE_56_CYCLES <<
        (GUARDIAN_ADC_CHANNEL_CURRENT * 3U);

    /* Configure 56-cycle sample time for ADC1 channel 4. */
    ADC1->SMPR2 &=
        ~((uint32_t)0x7U << (GUARDIAN_ADC_CHANNEL_SUPPLY * 3U));

    /* Apply the external-channel sample time for the supply divider. */
    ADC1->SMPR2 |=
        GUARDIAN_ADC_SAMPLE_56_CYCLES <<
        (GUARDIAN_ADC_CHANNEL_SUPPLY * 3U);

    /* Clear the channel-16 internal temperature sample-time field. */
    ADC1->SMPR1 &=
        ~((uint32_t)0x7U <<
          ((GUARDIAN_ADC_CHANNEL_TEMPERATURE - 10U) * 3U));

    /* Use the longest 480-cycle sample time for the internal temperature sensor. */
    ADC1->SMPR1 |=
        GUARDIAN_ADC_SAMPLE_480_CYCLES <<
        ((GUARDIAN_ADC_CHANNEL_TEMPERATURE - 10U) * 3U);

    /* Clear the channel-17 VREFINT sample-time field. */
    ADC1->SMPR1 &=
        ~((uint32_t)0x7U <<
          ((GUARDIAN_ADC_CHANNEL_VREFINT - 10U) * 3U));

