socorromipunto-eng/guardian-f401/firmware/Platform/STM32F401/Src/stm32f401_acquisition.c
    /* Use the longest 480-cycle sample time for VREFINT. */
    ADC1->SMPR1 |=
        GUARDIAN_ADC_SAMPLE_480_CYCLES <<
        ((GUARDIAN_ADC_CHANNEL_VREFINT - 10U) * 3U);

    /* Configure exactly five regular conversions. */
    ADC1->SQR1 =
        GUARDIAN_ADC_SQR1_LENGTH_5;

    /* Encode vibration channel 0 as regular sequence slot 1. */
    ADC1->SQR3 =
        (GUARDIAN_ADC_CHANNEL_VIBRATION << 0U) |

        /* Encode current channel 1 as regular sequence slot 2. */
        (GUARDIAN_ADC_CHANNEL_CURRENT << 5U) |

        /* Encode supply channel 4 as regular sequence slot 3. */
        (GUARDIAN_ADC_CHANNEL_SUPPLY << 10U) |

        /* Encode temperature channel 16 as regular sequence slot 4. */
        (GUARDIAN_ADC_CHANNEL_TEMPERATURE << 15U) |

        /* Encode VREFINT channel 17 as regular sequence slot 5. */
        (GUARDIAN_ADC_CHANNEL_VREFINT << 20U);

    /* Disable injected-sequence use in this acquisition milestone. */
    ADC1->JSQR = 0U;

    /* Apply the runtime-selected conservative ADC clock, disable VBAT and enable internal channels. */
    ADC->CCR =
        (ADC->CCR &
         ~(GUARDIAN_ADC_CCR_ADCPRE_MASK |
           GUARDIAN_ADC_CCR_VBATE)) |
        guardian_adc_prescaler_bits |
        GUARDIAN_ADC_CCR_TSVREFE;

    /* Select TIM2 TRGO rising edge, DMA mode and continuous DMA requests. */
    ADC1->CR2 =
        GUARDIAN_ADC_CR2_DMA |
        GUARDIAN_ADC_CR2_DDS |
        GUARDIAN_ADC_CR2_EXTSEL_TIM2_TRGO |
        GUARDIAN_ADC_CR2_EXTEN_RISING;

    /* Clear stale ADC status flags before enabling conversion. */
    ADC1->SR = 0U;

    /* Enable ADC1 while leaving conversions controlled exclusively by TIM2 TRGO. */
    ADC1->CR2 |=
        GUARDIAN_ADC_CR2_ADON;
}

/* Disable DMA2 Stream0 and wait for hardware acknowledgement. */
static int guardian_stm32f401_disable_dma(void)
{
    /* Request DMA2 Stream0 disable. */
    DMA2_Stream0->CR &=
        ~GUARDIAN_DMA_CR_EN;

    /* Bound the hardware-disable wait so a peripheral fault cannot hang firmware forever. */
    uint32_t timeout = 1000000UL;

    /* Wait until hardware clears the stream enable bit. */
    while ((DMA2_Stream0->CR & GUARDIAN_DMA_CR_EN) != 0U)
    {
        /* Fail when the bounded wait is exhausted. */
        if (timeout == 0U)
        {
            /* Report failed DMA shutdown. */
            return 0;
        }

        /* Advance toward the bounded timeout. */
        timeout -= 1U;
    }

    /* Report successful DMA shutdown. */
    return 1;
}

/* Configure DMA2 Stream0 Channel 0 for ADC1 peripheral-to-memory double buffering. */
static int guardian_stm32f401_configure_dma(void)
{
    /* Disable the stream before writing protected configuration fields. */
    if (guardian_stm32f401_disable_dma() == 0)
    {
        /* Report failed DMA reconfiguration. */
        return 0;
    }

    /* Clear every stale Stream0 status flag. */
    DMA2->LIFCR =
        GUARDIAN_DMA_STREAM0_ALL_FLAGS;

    /* Point the fixed peripheral address at ADC1 regular data register. */
    DMA2_Stream0->PAR =
        (uint32_t)(uintptr_t)&ADC1->DR;

    /* Point memory target zero at the first bounded raw sample buffer. */
    DMA2_Stream0->M0AR =
        (uint32_t)(uintptr_t)guardian_dma_buffer_0;

    /* Point memory target one at the second bounded raw sample buffer. */
    DMA2_Stream0->M1AR =
        (uint32_t)(uintptr_t)guardian_dma_buffer_1;

    /* Transfer one complete 64-frame interleaved scan block before target swapping. */
    DMA2_Stream0->NDTR =
        (uint32_t)GUARDIAN_ACQUISITION_SAMPLES_PER_BLOCK;

    /* Configure Channel 0, peripheral-to-memory, half-words, increment, high priority and DBM. */
    DMA2_Stream0->CR =
        GUARDIAN_DMA_CR_DMEIE |
        GUARDIAN_DMA_CR_TEIE |
        GUARDIAN_DMA_CR_TCIE |
        GUARDIAN_DMA_CR_CIRC |
        GUARDIAN_DMA_CR_MINC |
        GUARDIAN_DMA_CR_PSIZE_16 |
        GUARDIAN_DMA_CR_MSIZE_16 |
        GUARDIAN_DMA_CR_PRIORITY_HIGH |
        GUARDIAN_DMA_CR_DBM;

    /* Use direct mode because ADC half-word transfers do not require FIFO buffering. */
    DMA2_Stream0->FCR = 0U;

    /* Clear pending software ownership of both DMA targets before restart. */
    guardian_ready_mask = 0U;

    /* Configure the requested DMA2 Stream0 NVIC priority. */
    NVIC_SetPriority(
        DMA2_Stream0_IRQn,
        guardian_config.dma_irq_priority);

    /* Enable DMA2 Stream0 interrupt delivery. */
    NVIC_EnableIRQ(
        DMA2_Stream0_IRQn);

    /* Enable the fully configured double-buffer stream. */
    DMA2_Stream0->CR |=
        GUARDIAN_DMA_CR_EN;

    /* Report successful DMA configuration. */
    return 1;
}

/* Start or restart the deterministic TIM2 -> ADC1 -> DMA2 acquisition stream. */
static int guardian_stm32f401_start_stream(void)
{
    /* Stop TIM2 so no trigger arrives during ADC/DMA reconstruction. */
    TIM2->CR1 &=
        ~GUARDIAN_TIM_CR1_CEN;

    /* Disable ADC1 before rebuilding its DMA relationship. */
    ADC1->CR2 &=
        ~GUARDIAN_ADC_CR2_ADON;

    /* Rebuild ADC scan and trigger configuration. */
    guardian_stm32f401_configure_adc();

    /* Rebuild DMA target addresses, count and stream state. */
    if (guardian_stm32f401_configure_dma() == 0)
    {
        /* Report failed acquisition restart. */
        return 0;
    }

    /* Wait conservatively for ADC and internal temperature/VREFINT startup. */
    guardian_stm32f401_startup_delay();

    /* Reset the deterministic trigger counter before starting a new acquisition epoch. */
    TIM2->CNT = 0U;

    /* Clear timer status before enabling periodic triggers. */
    TIM2->SR = 0U;

    /* Start TIM2 while preserving auto-reload preload. */
    TIM2->CR1 |=
        GUARDIAN_TIM_CR1_CEN;

    /* Report successful acquisition stream start. */
    return 1;
}

/* Fill one configuration with reference hardware and factory calibration defaults. */
void guardian_stm32f401_acquisition_default_config(
    guardian_stm32f401_acquisition_config_t *config)
{
    /* Ignore a missing caller pointer defensively. */
    if (config == NULL)
    {
        /* Return without touching memory. */
        return;
    }

