socorromipunto-eng/guardian-f401/firmware/Platform/STM32F401/Src/stm32f401_acquisition.c
    /* Select the M6 reference ADC scan-frame rate. */
    config->sample_rate_hz =
        GUARDIAN_STM32F401_ACQUISITION_DEFAULT_SAMPLE_RATE_HZ;

    /* Assume one RPM sensor edge per revolution until hardware defines otherwise. */
    config->rpm_pulses_per_revolution = 1U;

    /* Keep DMA below the command-channel UART priority in the reference configuration. */
    config->dma_irq_priority = 6U;

    /* Keep RPM capture at the same bounded acquisition priority. */
    config->rpm_irq_priority = 6U;

    /* Keep ADC overrun reporting at the same bounded acquisition priority. */
    config->adc_irq_priority = 6U;

    /* Read the factory VREFINT calibration acquired at 3.3 V. */
    config->calibration.vrefint_cal_code =
        guardian_stm32f401_factory_u16(
            GUARDIAN_STM32F401_VREFINT_CAL_ADDRESS);

    /* Read the factory temperature calibration acquired at 30 C. */
    config->calibration.temperature_cal_30_code =
        guardian_stm32f401_factory_u16(
            GUARDIAN_STM32F401_TEMP_CAL_30_ADDRESS);

    /* Read the factory temperature calibration acquired at 110 C. */
    config->calibration.temperature_cal_110_code =
        guardian_stm32f401_factory_u16(
            GUARDIAN_STM32F401_TEMP_CAL_110_ADDRESS);

    /* Use midscale as a reference zero-g placeholder for an analog vibration front-end. */
    config->calibration.vibration_zero_code = 2048U;

    /* Use one milli-g per normalized ADC code until the actual vibration sensor is calibrated. */
    config->calibration.vibration_mg_per_code_num = 1U;

    /* Keep the reference vibration scale denominator explicit. */
    config->calibration.vibration_mg_per_code_den = 1U;

    /* Use ground-referenced zero current until the actual sensor front-end is calibrated. */
    config->calibration.current_zero_code = 0U;

    /* Map full-scale normalized ADC code to 5 A as a reference current-sensor placeholder. */
    config->calibration.current_ma_per_code_num = 5000U;

    /* Divide by 12-bit full scale for the reference current mapping. */
    config->calibration.current_ma_per_code_den =
        GUARDIAN_ACQUISITION_ADC_MAX_CODE;

    /* Assume a 1:1 resistor divider so the measured supply equals twice the PA4 pin voltage. */
    config->calibration.supply_divider_num = 2U;

    /* Keep the divider denominator explicit. */
    config->calibration.supply_divider_den = 1U;

    /* Mark external sensor scaling as reference calibration until real hardware values replace it. */
    config->calibration.base_status_flags =
        GUARDIAN_ACQUISITION_STATUS_DEFAULT_CALIBRATION;
}

/* Initialize TIM2-triggered ADC1 scan, DMA2 double buffer and TIM3 RPM capture. */
int guardian_stm32f401_acquisition_init(
    const guardian_stm32f401_acquisition_config_t *config)
{
    /* Store portable acquisition initialization status. */
    guardian_acquisition_result_t result =
        GUARDIAN_ACQUISITION_OK;

    /* Mark hardware unavailable until this complete initialization succeeds. */
    guardian_initialized = 0U;

    /* Reset cumulative hardware diagnostics for the new acquisition epoch. */
    guardian_hw_stats.dma_blocks_completed = 0U;
    guardian_hw_stats.dma_blocks_dropped = 0U;
    guardian_hw_stats.dma_errors = 0U;
    guardian_hw_stats.adc_overruns = 0U;
    guardian_hw_stats.recoveries = 0U;
    guardian_hw_stats.rpm_edges = 0U;

    /* Reject a missing configuration pointer. */
    if (config == NULL)
    {
        /* Report invalid initialization. */
        return 0;
    }

    /* Enforce the documented deterministic ADC scan-frame rate range. */
    if ((config->sample_rate_hz <
         GUARDIAN_STM32F401_ACQUISITION_MIN_SAMPLE_RATE_HZ) ||
        (config->sample_rate_hz >
         GUARDIAN_STM32F401_ACQUISITION_MAX_SAMPLE_RATE_HZ))
    {
        /* Report unsupported sample timing. */
        return 0;
    }

    /* Require at least one RPM sensor pulse per shaft revolution. */
    if (config->rpm_pulses_per_revolution == 0U)
    {
        /* Report invalid RPM configuration. */
        return 0;
    }

    /* Refresh CMSIS SystemCoreClock after the application's clock setup. */
    SystemCoreClockUpdate();

    /* Copy the complete validated hardware configuration by value. */
    guardian_config = *config;

    /* Select the fastest ADC clock that remains within the conservative datasheet limit. */
    if (guardian_stm32f401_select_adc_clock() == 0)
    {
        /* Report an unsupported APB2/ADC clock relationship. */
        return 0;
    }

    /* Require enough ADC cycles to finish all five conversions before the next TIM2 trigger. */
    if ((uint64_t)guardian_adc_clock_hz <
        (
            (uint64_t)guardian_config.sample_rate_hz *
            (uint64_t)GUARDIAN_ADC_SEQUENCE_CYCLES
        ))
    {
        /* Report a sample rate that would overlap regular scan sequences. */
        return 0;
    }

    /* Initialize the portable acquisition processor before enabling peripherals. */
    result =
        guardian_acquisition_init(
            &guardian_acquisition,
            &guardian_config.calibration);

    /* Reject unusable calibration before acquiring raw data. */
    if (result != GUARDIAN_ACQUISITION_OK)
    {
        /* Report failed initialization. */
        return 0;
    }

    /* Enable GPIOA clock for PA0, PA1, PA4 and PA6. */
    RCC->AHB1ENR |=
        GUARDIAN_RCC_AHB1_GPIOAEN;

    /* Enable DMA2 clock for ADC1 transfers. */
    RCC->AHB1ENR |=
        GUARDIAN_RCC_AHB1_DMA2EN;

    /* Enable TIM2 and TIM3 clocks on APB1. */
    RCC->APB1ENR |=
        GUARDIAN_RCC_APB1_TIM2EN |
        GUARDIAN_RCC_APB1_TIM3EN;

    /* Enable ADC1 clock on APB2. */
    RCC->APB2ENR |=
        GUARDIAN_RCC_APB2_ADC1EN;

    /* Perform a readback so peripheral clocks are visible before register access. */
    (void)RCC->APB2ENR;

    /* Configure PA0 as analog vibration input. */
    guardian_stm32f401_gpio_analog(
        GUARDIAN_STM32F401_VIBRATION_PIN);

    /* Configure PA1 as analog current input. */
    guardian_stm32f401_gpio_analog(
        GUARDIAN_STM32F401_CURRENT_PIN);

    /* Configure PA4 as analog supply-divider input. */
    guardian_stm32f401_gpio_analog(
        GUARDIAN_STM32F401_SUPPLY_PIN);

    /* Configure PA6 AF2 as TIM3_CH1 RPM input capture. */
    guardian_stm32f401_gpio_rpm();

