socorromipunto-eng/guardian-f401/firmware/Platform/STM32F401/Src/stm32f401_acquisition.c
    /* Configure the deterministic TIM2 ADC trigger. */
    if (guardian_stm32f401_configure_sample_timer() == 0)
    {
        /* Report failed sample timer configuration. */
        return 0;
    }

    /* Configure TIM3 RPM input capture. */
    if (guardian_stm32f401_configure_rpm_timer() == 0)
    {
        /* Report failed RPM timer configuration. */
        return 0;
    }

    /* Configure ADC overrun interrupt priority. */
    NVIC_SetPriority(
        ADC_IRQn,
        guardian_config.adc_irq_priority);

    /* Enable ADC overrun interrupt delivery. */
    NVIC_EnableIRQ(
        ADC_IRQn);

    /* Reset asynchronous hardware state before the first stream start. */
    guardian_last_rpm_timestamp = 0U;

    /* Reset the software extension of the TIM3 16-bit counter. */
    guardian_rpm_overflow_count = 0U;

    /* Reset RPM period history. */
    guardian_has_rpm_capture = 0U;

    /* Start without a valid RPM measurement. */
    guardian_rpm = 0U;

    /* Start RPM age at the stale sentinel. */
    guardian_rpm_age_ms = UINT32_MAX;

    /* Mark RPM invalid until two edges establish one complete period. */
    guardian_rpm_valid = 0U;

    /* Clear pending hardware quality flags. */
    guardian_pending_quality_flags = 0U;

    /* Clear pending recovery state. */
    guardian_recovery_required = 0U;

    /* Start the deterministic ADC/DMA acquisition stream. */
    if (guardian_stm32f401_start_stream() == 0)
    {
        /* Report failed acquisition stream startup. */
        return 0;
    }

    /* Publish successful hardware initialization. */
    guardian_initialized = 1U;

    /* Report successful acquisition initialization. */
    return 1;
}

/* Process at most one completed DMA target buffer in foreground code. */
int guardian_stm32f401_acquisition_poll_ex(
    guardian_machine_measurements_t *measurements,
    guardian_acquisition_signal_block_t *signal_block)
{
    /* Store the selected stable DMA target index. */
    uint8_t selected_buffer = 0xFFU;

    /* Store a snapshot of pending hardware quality flags. */
    uint16_t hardware_flags = 0U;

    /* Store a coherent RPM snapshot. */
    guardian_acquisition_aux_t aux = {0};

    /* Store portable processing outcome. */
    guardian_acquisition_result_t result =
        GUARDIAN_ACQUISITION_OK;

    /* Store interrupt state before a short critical section. */
    uint32_t primask = 0U;

    /* Track the current raw half-word while snapshotting one stable DMA target. */
    size_t sample_index = 0U;

    /* Store the selected DMA target pointer after ownership validation. */
    const uint16_t *selected_samples = NULL;

    /* Reject a missing output pointer or uninitialized hardware. */
    if ((measurements == NULL) ||
        (guardian_initialized == 0U))
    {
        /* Report no fresh measurement. */
        return 0;
    }

    /* Recover ADC/DMA state in foreground rather than inside an interrupt handler. */
    if (guardian_recovery_required != 0U)
    {
        /* Attempt a complete deterministic acquisition stream rebuild. */
        if (guardian_stm32f401_start_stream() == 0)
        {
            /* Report hardware recovery failure. */
            return -1;
        }

        /* Enter a short critical section before clearing the recovery request. */
        primask = __get_PRIMASK();

        /* Prevent IRQ state from changing while the recovery flag is acknowledged. */
        __disable_irq();

        /* Clear the recovery request after successful stream reconstruction. */
        guardian_recovery_required = 0U;

        /* Restore interrupts only when they were enabled before this critical section. */
        if (primask == 0U)
        {
            /* Re-enable interrupt delivery. */
            __enable_irq();
        }

        /* Count the successful acquisition recovery. */
        guardian_stm32f401_increment_u32(
            &guardian_hw_stats.recoveries);
    }

    /* Preserve the caller's previous interrupt-enable state. */
    primask = __get_PRIMASK();

    /* Enter a very short ownership critical section. */
    __disable_irq();

    /* Prefer the oldest conventional buffer ordering when buffer zero is ready. */
    if ((guardian_ready_mask &
         GUARDIAN_DMA_BUFFER_0_READY) != 0U)
    {
        /* Claim buffer zero for foreground processing. */
        selected_buffer = 0U;

        /* Clear its pending-ready bit before processing. */
        guardian_ready_mask &=
            (uint8_t)~GUARDIAN_DMA_BUFFER_0_READY;
    }
    else if ((guardian_ready_mask &
              GUARDIAN_DMA_BUFFER_1_READY) != 0U)
    {
        /* Claim buffer one for foreground processing. */
        selected_buffer = 1U;

        /* Clear its pending-ready bit before processing. */
        guardian_ready_mask &=
            (uint8_t)~GUARDIAN_DMA_BUFFER_1_READY;
    }

    /* Snapshot pending quality flags for the next processed block. */
    hardware_flags =
        guardian_pending_quality_flags;

    /* Clear pending flags only when one actual raw block was claimed. */
    if (selected_buffer != 0xFFU)
    {
        /* Transfer hardware-quality ownership to this block. */
        guardian_pending_quality_flags = 0U;
    }

    /* Snapshot the latest RPM value. */
    aux.rpm = guardian_rpm;

    /* Snapshot RPM freshness. */
    aux.rpm_valid = guardian_rpm_valid;

    /* Attach all hardware-quality flags to this block. */
    aux.hardware_status_flags =
        hardware_flags;

    /* Restore interrupts only when they were enabled before this critical section. */
    if (primask == 0U)
    {
        /* Re-enable interrupt delivery. */
        __enable_irq();
    }

    /* Return immediately when no complete DMA block is pending. */
    if (selected_buffer == 0xFFU)
    {
        /* Report no fresh measurement. */
        return 0;
    }

    /* Select the claimed stable DMA target pointer. */
    selected_samples =
        (selected_buffer == 0U)
        ? guardian_dma_buffer_0
        : guardian_dma_buffer_1;

    /* Reject a stale ownership token if DMA has already switched back to this target. */
    if (((selected_buffer == 0U) &&
         ((DMA2_Stream0->CR & GUARDIAN_DMA_CR_CT) == 0U)) ||
        ((selected_buffer == 1U) &&
         ((DMA2_Stream0->CR & GUARDIAN_DMA_CR_CT) != 0U)))
    {
        /* Preserve caller interrupt state before updating shared drop diagnostics. */
        primask = __get_PRIMASK();

        /* Enter a short critical section. */
        __disable_irq();

        /* Count the block that became active before foreground could snapshot it. */
        guardian_stm32f401_increment_u32(
            &guardian_hw_stats.dma_blocks_dropped);

        /* Preserve previous quality events and attach data loss to the next trustworthy block. */
        guardian_pending_quality_flags |=
            hardware_flags |
            GUARDIAN_ACQUISITION_STATUS_DMA_DROP;

        /* Restore interrupts only when they were previously enabled. */
        if (primask == 0U)
        {
            /* Re-enable interrupt delivery. */
            __enable_irq();
        }

        /* Report no fresh trustworthy measurement. */
        return 0;
    }

    /* Copy the completed DMA target into foreground-owned memory before conversion math. */
    for (sample_index = 0U;
         sample_index < GUARDIAN_ACQUISITION_SAMPLES_PER_BLOCK;
         ++sample_index)
    {
        /* Snapshot exactly one raw half-word. */
        guardian_process_buffer[sample_index] =
            selected_samples[sample_index];
    }

    /* Verify DMA did not switch back to the selected target during the bounded snapshot copy. */
    if (((selected_buffer == 0U) &&
         ((DMA2_Stream0->CR & GUARDIAN_DMA_CR_CT) == 0U)) ||
        ((selected_buffer == 1U) &&
         ((DMA2_Stream0->CR & GUARDIAN_DMA_CR_CT) != 0U)))
    {
        /* Preserve caller interrupt state before updating shared drop diagnostics. */
        primask = __get_PRIMASK();

        /* Enter a short critical section. */
        __disable_irq();

        /* Count the snapshot that raced the next DMA target reuse. */
        guardian_stm32f401_increment_u32(
            &guardian_hw_stats.dma_blocks_dropped);

        /* Preserve previous quality events and attach data loss to the next trustworthy block. */
        guardian_pending_quality_flags |=
            hardware_flags |
            GUARDIAN_ACQUISITION_STATUS_DMA_DROP;

        /* Restore interrupts only when they were previously enabled. */
        if (primask == 0U)
        {
            /* Re-enable interrupt delivery. */
            __enable_irq();
        }

        /* Report no fresh trustworthy measurement. */
        return 0;
    }

