socorromipunto-eng/guardian-f401/firmware/Platform/STM32F401/Src/stm32f401_acquisition.c
    /* Convert the immutable foreground snapshot and export calibrated vibration for M7 DSP. */
    result =
        guardian_acquisition_process_block_ex(
            &guardian_acquisition,
            guardian_process_buffer,
            GUARDIAN_ACQUISITION_SAMPLES_PER_BLOCK,
            &aux,
            guardian_config.sample_rate_hz,
            signal_block);

    /* Reject blocks that fail portable reference or calibration validation. */
    if (result != GUARDIAN_ACQUISITION_OK)
    {
        /* Preserve caller interrupt state before requeueing quality diagnostics. */
        primask = __get_PRIMASK();

        /* Enter a short critical section. */
        __disable_irq();

        /* Carry forward prior hardware events and mark the rejected ADC measurement. */
        guardian_pending_quality_flags |=
            hardware_flags |
            GUARDIAN_ACQUISITION_STATUS_ADC_ERROR;

        /* Restore interrupts only when they were previously enabled. */
        if (primask == 0U)
        {
            /* Re-enable interrupt delivery. */
            __enable_irq();
        }

        /* Report the foreground processing failure. */
        return -1;
    }

    /* Return the latest coherent engineering-unit snapshot to the firmware application. */
    *measurements =
        guardian_acquisition_latest(
            &guardian_acquisition);

    /* Report exactly one fresh measurement block. */
    return 1;
}


/* Preserve the M6 public API by polling without requesting a calibrated DSP signal block. */
int guardian_stm32f401_acquisition_poll(
    guardian_machine_measurements_t *measurements)
{
    /* Reuse the extended M7 polling path without signal export. */
    return guardian_stm32f401_acquisition_poll_ex(
        measurements,
        NULL);
}

/* Advance RPM staleness tracking by one millisecond. */
void guardian_stm32f401_acquisition_tick_1ms(void)
{
    /* Ignore ticks before hardware initialization completes. */
    if (guardian_initialized == 0U)
    {
        /* Return without touching acquisition state. */
        return;
    }

    /* Saturate RPM age instead of wrapping. */
    if (guardian_rpm_age_ms != UINT32_MAX)
    {
        /* Advance one millisecond. */
        guardian_rpm_age_ms += 1U;
    }

    /* Mark RPM stale after the documented timeout. */
    if (guardian_rpm_age_ms >
        GUARDIAN_STM32F401_RPM_STALE_MS)
    {
        /* Prevent stale RPM from being published as current machine speed. */
        guardian_rpm_valid = 0U;
    }
}

/* Return a coherent copy of hardware acquisition diagnostics. */
guardian_stm32f401_acquisition_stats_t guardian_stm32f401_acquisition_stats(void)
{
    /* Create local non-volatile diagnostic storage. */
    guardian_stm32f401_acquisition_stats_t stats = {0};

    /* Preserve caller interrupt state before copying ISR-updated counters. */
    uint32_t primask =
        __get_PRIMASK();

    /* Enter a short diagnostic snapshot critical section. */
    __disable_irq();

    /* Copy completed DMA block count. */
    stats.dma_blocks_completed =
        guardian_hw_stats.dma_blocks_completed;

    /* Copy dropped DMA block count. */
    stats.dma_blocks_dropped =
        guardian_hw_stats.dma_blocks_dropped;

    /* Copy DMA error count. */
    stats.dma_errors =
        guardian_hw_stats.dma_errors;

    /* Copy ADC overrun count. */
    stats.adc_overruns =
        guardian_hw_stats.adc_overruns;

    /* Copy successful recovery count. */
    stats.recoveries =
        guardian_hw_stats.recoveries;

    /* Copy valid RPM edge count. */
    stats.rpm_edges =
        guardian_hw_stats.rpm_edges;

    /* Restore interrupts only when they were enabled before this critical section. */
    if (primask == 0U)
    {
        /* Re-enable interrupt delivery. */
        __enable_irq();
    }

    /* Return the coherent diagnostic snapshot by value. */
    return stats;
}

/* Service DMA2 Stream0 completion and transfer-error events. */
void guardian_stm32f401_acquisition_dma_irq_handler(void)
{
    /* Snapshot the Stream0 low interrupt status bits. */
    uint32_t status =
        DMA2->LISR;

    /* Detect DMA transfer or direct-mode errors. */
    if ((status &
         (GUARDIAN_DMA_TEIF0 |
          GUARDIAN_DMA_DMEIF0 |
          GUARDIAN_DMA_FEIF0)) != 0U)
    {
        /* Count one DMA fault event. */
        guardian_stm32f401_increment_u32(
            &guardian_hw_stats.dma_errors);

        /* Mark the next trustworthy measurement with a DMA error. */
        guardian_pending_quality_flags |=
            GUARDIAN_ACQUISITION_STATUS_DMA_ERROR;

        /* Request full ADC/DMA recovery in foreground code. */
        guardian_recovery_required = 1U;

        /* Discard any pending target ownership because the failed transfer may be incomplete. */
        guardian_ready_mask = 0U;

        /* Clear every Stream0 flag observed by this handler. */
        DMA2->LIFCR =
            status &
            GUARDIAN_DMA_STREAM0_ALL_FLAGS;

        /* Return without publishing a potentially corrupted DMA target. */
        return;
    }

    /* Detect one completed DMA target buffer. */
    if ((status &
         GUARDIAN_DMA_TCIF0) != 0U)
    {
        /* Store which target just completed after hardware swapped CT. */
        uint8_t completed_mask = 0U;

        /* Store which target hardware has already started filling next. */
        uint8_t active_mask = 0U;

        /* CT=1 means DMA now writes M1, so M0 just completed. */
        if ((DMA2_Stream0->CR &
             GUARDIAN_DMA_CR_CT) != 0U)
        {
            /* Select the completed first target buffer. */
            completed_mask =
                GUARDIAN_DMA_BUFFER_0_READY;

            /* Identify the newly active second target buffer. */
            active_mask =
                GUARDIAN_DMA_BUFFER_1_READY;
        }
        else
        {
            /* CT=0 means DMA now writes M0, so M1 just completed. */
            completed_mask =
                GUARDIAN_DMA_BUFFER_1_READY;

            /* Identify the newly active first target buffer. */
            active_mask =
                GUARDIAN_DMA_BUFFER_0_READY;
        }

