socorromipunto-eng/guardian-f401/firmware/Platform/STM32F401/Src/stm32f401_acquisition.c
        /* Invalidate any unprocessed block whose memory target is being reused now. */
        if ((guardian_ready_mask &
             active_mask) != 0U)
        {
            /* Remove stale ownership before foreground can read a buffer being overwritten. */
            guardian_ready_mask &=
                (uint8_t)~active_mask;

            /* Count the overwritten unprocessed block. */
            guardian_stm32f401_increment_u32(
                &guardian_hw_stats.dma_blocks_dropped);

            /* Mark the next trustworthy processed block with the data-loss diagnostic. */
            guardian_pending_quality_flags |=
                GUARDIAN_ACQUISITION_STATUS_DMA_DROP;
        }

        /* Detect impossible duplicate completion ownership defensively. */
        if ((guardian_ready_mask &
             completed_mask) != 0U)
        {
            /* Count the stale completed-target ownership. */
            guardian_stm32f401_increment_u32(
                &guardian_hw_stats.dma_blocks_dropped);

            /* Preserve the data-loss diagnostic. */
            guardian_pending_quality_flags |=
                GUARDIAN_ACQUISITION_STATUS_DMA_DROP;
        }

        /* Publish only the completed target that is no longer active. */
        guardian_ready_mask |=
            completed_mask;

        /* Count the completed DMA block. */
        guardian_stm32f401_increment_u32(
            &guardian_hw_stats.dma_blocks_completed);
    }

    /* Clear every Stream0 flag observed by this handler. */
    DMA2->LIFCR =
        status &
        GUARDIAN_DMA_STREAM0_ALL_FLAGS;
}

/* Service ADC1 overrun events that require deterministic stream recovery. */
void guardian_stm32f401_acquisition_adc_irq_handler(void)
{
    /* Snapshot ADC1 status before clearing writable flags. */
    uint32_t status =
        ADC1->SR;

    /* Handle only the overrun condition used by M6 diagnostics. */
    if ((status &
         GUARDIAN_ADC_SR_OVR) != 0U)
    {
        /* Count the ADC overrun event. */
        guardian_stm32f401_increment_u32(
            &guardian_hw_stats.adc_overruns);

        /* Mark the next trustworthy block with an ADC error diagnostic. */
        guardian_pending_quality_flags |=
            GUARDIAN_ACQUISITION_STATUS_ADC_ERROR;

        /* Request the RM0368-required ADC/DMA reconstruction in foreground code. */
        guardian_recovery_required = 1U;

        /* Clear the write-zero-to-clear OVR status bit. */
        ADC1->SR &=
            ~GUARDIAN_ADC_SR_OVR;
    }
}

/* Service TIM3 channel-1 RPM input-capture and counter-overflow events. */
void guardian_stm32f401_acquisition_tim3_irq_handler(void)
{
    /* Snapshot TIM3 status before clearing update or capture flags. */
    uint32_t status =
        TIM3->SR;

    /* Snapshot the software overflow epoch associated with the current interrupt. */
    uint32_t overflow_snapshot =
        guardian_rpm_overflow_count;

    /* Process one valid channel-1 capture. */
    if ((status &
         GUARDIAN_TIM_SR_CC1IF) != 0U)
    {
        /* Read the captured 16-bit free-running timer value. */
        uint16_t capture =
            (uint16_t)TIM3->CCR1;

        /* Start with the overflow epoch visible when this interrupt began. */
        uint32_t capture_overflows =
            overflow_snapshot;

        /* Resolve a capture that occurred just after an unserviced timer wrap. */
        if (((status &
              GUARDIAN_TIM_SR_UIF) != 0U) &&
            (capture < 0x8000U))
        {
            /* Associate the low capture value with the newly completed timer epoch. */
            capture_overflows += 1U;
        }

        /* Combine the software epoch and hardware CCR1 into one 32-bit modulo timestamp. */
        uint32_t capture_timestamp =
            (capture_overflows << 16U) |
            (uint32_t)capture;

        /* Count the observed shaft-sensor edge. */
        guardian_stm32f401_increment_u32(
            &guardian_hw_stats.rpm_edges);

        /* Calculate RPM only after one previous edge establishes a complete period. */
        if (guardian_has_rpm_capture != 0U)
        {
            /* Unsigned 32-bit subtraction supports many TIM3 wraps between shaft edges. */
            uint32_t period_ticks =
                capture_timestamp -
                guardian_last_rpm_timestamp;

            /* Reject a zero-width period caused by duplicate or noisy captures. */
            if (period_ticks != 0U)
            {
                /* Build the denominator from measured timer ticks and pulses per revolution. */
                uint64_t denominator =
                    (uint64_t)period_ticks *
                    (uint64_t)guardian_config.rpm_pulses_per_revolution;

                /* Calculate RPM with nearest-integer rounding. */
                uint64_t rpm =
                    (
                        ((uint64_t)guardian_rpm_timer_hz * 60ULL) +
                        (denominator / 2ULL)
                    ) /
                    denominator;

                /* Saturate the published telemetry RPM field. */
                if (rpm > UINT16_MAX)
                {
                    /* Clamp unexpectedly high speed to the wire-field maximum. */
                    rpm = UINT16_MAX;
                }

                /* Publish the new shaft speed. */
                guardian_rpm =
                    (uint16_t)rpm;

                /* Reset RPM freshness age. */
                guardian_rpm_age_ms = 0U;

                /* Mark the RPM value fresh. */
                guardian_rpm_valid = 1U;
            }
        }

        /* Preserve this extended edge timestamp for the next period measurement. */
        guardian_last_rpm_timestamp =
            capture_timestamp;

        /* Mark that one previous capture now exists. */
        guardian_has_rpm_capture = 1U;
    }

    /* Extend the 16-bit TIM3 counter whenever one update event occurred. */
    if ((status &
         GUARDIAN_TIM_SR_UIF) != 0U)
    {
        /* Advance the software timer epoch modulo 2^32 capture timestamps. */
        guardian_rpm_overflow_count += 1U;
    }

    /* Treat capture overrun as stale RPM rather than publishing an ambiguous period. */
    if ((status &
         GUARDIAN_TIM_SR_CC1OF) != 0U)
    {
        /* Invalidate the current RPM measurement. */
        guardian_rpm_valid = 0U;

        /* Require two new clean edges before another period is published. */
        guardian_has_rpm_capture = 0U;
    }

    /* Clear every TIM3 status flag handled by this adapter. */
    TIM3->SR &=
        ~(GUARDIAN_TIM_SR_CC1IF |
          GUARDIAN_TIM_SR_CC1OF |
          GUARDIAN_TIM_SR_UIF);
}
